---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisConceptualConstruction
source: html/29ab0807-fa74-83e6-7662-ac578c8b1048.htm
---
# Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisConceptualConstruction Property

"Conceptual Types"

## Syntax (C#)
```csharp
public static ForgeTypeId EnergyAnalysisConceptualConstruction { get; }
```